---
kind: type
id: T:Autodesk.Revit.DB.FabricationService
source: html/e29ecbb2-7de0-c341-0db0-9f77bd0f5543.htm
---
# Autodesk.Revit.DB.FabricationService

This object contains information about a fabrication service.

## Syntax (C#)
```csharp
public class FabricationService : IDisposable
```

## Remarks
A fabrication service defines what fabrication service buttons that can be used. Fabrication services are part of the fabrication configuration.